04_OpenFoam/_Tut_02/OpenFOAM-14/multiRegion/film/cylinderVoF/0/VoF/alpha.liquid
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0/VoF";
    object      alpha.liquid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [];

internalField   uniform 0;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    film
    {
        type            zeroGradient;
    }

    "(sides|frontAndBack)"
    {
        type            zeroGradient;
    }

    top
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
