04_OpenFoam/_Tut_02/OpenFOAM-14/multiRegion/film/cylinderVoF/Allrun-parallel
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication -s VoF blockMesh -region VoF

runApplication decomposePar -region VoF -noFields

runParallel extrudeToRegionMesh -region VoF

runApplication -s fields decomposePar -fields -copyZero

runParallel foamMultiRun

runApplication reconstructPar -allRegions

#------------------------------------------------------------------------------
